app/controllers/api/v1/frontend_controller.rb

  def fetch_all_users
    users = User.all
---
SELECT "users".* FROM "users"

  def reset_all_users
    users = User.all
    users.each do |user|
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users"

  def mark_user_as_seen
    user_id = params["user_id"]
    accepted = params["accepted"]
    user = User.find(user_id)
    user.new = false
    accepted == true ? user.matched = true : user.matched = false
    user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
UPDATE "users" SET "new" = $1, "matched" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["new", false], ["matched", true], ["updated_at", "2019-07-21 16:58:34.052778"], ["id", 37]]