app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    posts = Post.all

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["content", "test"], ["created_at", "2019-06-16 15:39:47.391761"], ["updated_at", "2019-06-16 15:39:47.391761"]]
---
  def create
    post = Post.create(post_params)