app/controllers/frontend_controller.rb

SELECT "users".* FROM "users"
---
  def fetch_all_users
    users = User.all