app/controllers/pages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."matched" = $1  [["matched", true]]
---
  def home
    @posts = Post.all
    @users = User.all
    @conversations = User.all.where(matched: true)