app/controllers/pages_controller.rb

  def home
    @posts = Post.all
    @users = User.all
    @conversations = Message.all
---
SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 1]]
SELECT "messages".* FROM "messages"